linkid-sdk-ws/src/test/resources/test-ws-security-invalid-message.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       soap:mustUnderstand="1">
            <wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                                      EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                                      ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                                      wsu:Id="CertId-1497"
                                      xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                MIIB8zCCAVygAwIBAgIQIXwHNZieKBWSju2XKOeGcjANBgkqhkiG9w0BAQ0FADAPMQ0wCwYDVQQDDARUZXN0MB4XDTA3MDIyNjE1MDYxMVoXDTE3MDIyNjE1MDYxMVowDzENMAsGA1UEAwwEVGVzdDCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAh0Eufk4K+mbfE889KFmRBc9H2+cECOF5BKz0UvCjRD5PyIQQNsYzmerODJKc7nbUEDpJgHd2iu4EhDE5fqRJgygGkPgOOGNfLZEKMnzbzdVKin2ST7h4d18y5qF/ZLlrnILFzngoer8akOmoGBwIt3C9OuAYj48P8tuNEiuGAZcCAwEAAaNQME4wHQYDVR0OBBYEFHbhySejiSqYlfiCKV8U+s5S6PV9MB8GA1UdIwQYMBaAFHbhySejiSqYlfiCKV8U+s5S6PV9MAwGA1UdEwQFMAMBAf8wDQYJKoZIhvcNAQENBQADgYEAgV5Q+FDtsASWXrfniAkf9mWn5KW2K//fBHD3BSoQJ5J4Sz5/5F3ZeJRN5J+tbSwdYPcJdlzh78vOSkGgYtbrf/5xWZXZ8w6j5NAQkkFRPu/aDmzJ6HlEoVHddL7CldDfsb8JRroAPuy9PmiGQzFTF9IEpZan87+GK4zbSGkj0J0=
            </wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-29232906">
                <ds:SignedInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"
                                               xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"
                                        xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                    <ds:Reference URI="#id-21414356" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                        <ds:Transforms xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"
                                          xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                        <ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">PjxUjac84nKamQJ2fTUh8mIBFHc=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#Timestamp-9616314" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                        <ds:Transforms xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"
                                          xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
                        <ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">GXRmSvoRCsYlrdqCnkwbh5ldnYE=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    Otl3o4vS0yAX93eYP9KZgqux1pHzIJSB0eR8H9yPIBIbQj450ZBt29CSUri+WovrHkp7vU2q4SY9
                    H1b+4f2fWKdAY1ysPuLZMo3/S3L8DZTHOlCSCAOIbfU0ZSUVJ5MU/fJP56RORH5Ywg7iwb6ZvY11
                    VXtMw3cqLsqFbukMI5s=
                </ds:SignatureValue>
                <ds:KeyInfo Id="KeyId-20634710" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <wsse:SecurityTokenReference
                            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                            wsu:Id="STRId-7295144"
                            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                        <wsse:Reference URI="#CertId-1497"
                                        ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                                        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" />
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                           wsu:Id="Timestamp-9616314">
                <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                    2007-02-26T15:06:11.824Z
                </wsu:Created>
            </wsu:Timestamp>
        </wsse:Security>
    </soap:Header>
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-21414356">
        <tns:root xmlns:tns="urn:test">Foobar</tns:root>
    </soap:Body>
</soap:Envelope>
